[
  {
    "id": "what-we-like-on-the-web-this-year",
    "title": "What we liked on the web this year (so far)",
    "intro": "We'll start our blogging operations with a relaxed article about some of the websites we liked this year. What are your favorites so far?",
    "cover": "cover.jpg",
    "date": "2015-02-12T12:30:18.101Z",
    "author": {
      "name": "Dan Mindru",
      "gplus": "https://plus.google.com/+MindruDan?rel=author",
      "photo": "src/assets/img/team/fadeit_team_dan_mindru.jpg",
      "job_title": "Experience designer"
    },
    "content": [
      {
        "type": "p",
        "text": "Before we hit you up with some piece of code or life-changing tutorial, we wanted to write something more mellow on our blog. In this article we'll present some of the impressive, beautiful or simply outstanding things we found on the web."
      },
      {
        "type": "h",
        "number": 2,
        "text": "Immersive is so 2007 [Giant Steps Media]"
      },
      {
        "type": "p",
        "text": "<a href='http://www.giantstepsmedias.com/projets' target='_blank'>Giant Steps Media</a><br/>In the good old days of Flash we would see websites like this one fairly often. However, it's not everyday that we see a site that uses a combination of sound and animation to take control of your imagination. We like this one because it works, it didn't freeze our browser and it reminds us of a <a href='http://www.noiseboard.com.au/' target='_blank'>great animation from last year</a>."
      },
      {
        "type": "img",
        "url": "posts/what-we-like-on-the-web-this-year/giant-steps-medias-site.jpg",
        "caption": "A screenshot of the Giant Steps Media website"
      },
      {
        "type": "h",
        "number": 2,
        "text": "But how does it look on mobile? [Rally Interactive]"
      },
      {
        "type": "p",
        "text": "<a href='http://beta.rallyinteractive.com/' target='_blank'>Rally Interactive</a><br/> Where to begin with this piece? It's probably the only website which made us lift up our chairs and say: check this one out on the phone! After you finish playing with the top animation, don't forget to take a look at their projects too."
      },
      {
        "type": "img",
        "url": "posts/what-we-like-on-the-web-this-year/rally-interactive.jpg",
        "caption": "A screenshot of the Rally Interactive website"
      },
      {
        "type": "h",
        "number": 2,
        "text": "Are we still calling them experiments? [Google]"
      },
      {
        "type": "p",
        "text": "<a href='http://1000.chromeexperiments.com/' target='_blank'>Rally Interactive</a><br/> More than 5 years and 1000 experiments later, Google decided is time to display all the experiments in a... experimental way. We admire the creativity behind this milestone-application and look forward to number 10000, when hopefully we won't call them experiments any more."
      },
      {
        "type": "img",
        "url": "posts/what-we-like-on-the-web-this-year/google-experiments.jpg",
        "caption": "A screenshot of the 1000th Chrome Experiment"
      },
      {
        "type": "p",
        "text": "I'll stop the list at 3 and perhaps write a few follow-up posts with other impressive websites. Is there something you saw this year that can blow our mind?"
      }
    ]
  }
]
