[
  {
    "id": "fadeit-blog-is-live",
    "title": "Blog: open for business",
    "intro": "We're super excited to launch a blog section on our website. We'll be writing about design, tech, code and everything in between.",
    "cover": "cover.jpg",
    "date": "2015-01-17T19:28:14.465Z",
    "no_related": true,
    "author": {
      "name": "Dan Mindru",
      "gplus": "https://plus.google.com/+MindruDan?rel=author",
      "photo": "src/assets/img/team/fadeit_team_dan_mindru.jpg",
      "job_title": "Experience designer"
    },
    "content": [
      {
        "type": "p",
        "text": "Many of the projects we do at fadeit bring specific problems to the table. Sometimes to find a solution we need to 'learn by suffering', other times things go very smooth. We think that in both cases the experience gained is what really matters.<br/> Technologies change fast, therefore if the only thing you learn is how to deal with a problem within a technology, you are probaly going to have a hard time."
      },
      {
        "type": "p",
        "text": "Naturally, we want to share this experience and try to help somebody else solve the same problems faster. For the past few weeks we've been brainstorming on how to better communicate this with 'the outside world'. One of the results was adding the danish language* to our website and releasing a new design iteration. <br/> We also thought of creating a newsletter, moving our content-sharing activities to Medium or even hosting workshops.<br/> Obviously, one idea was to create this blog, which we could do fairly quickly. We really hope that it be helpful to someone out there. On top of that, we hope that it will paint a clear image of what fadeit really is all about.<br/> <small>*For productivity reasons, we'll keep the blog only in English, but we might write an article or two in danish.</small>"
      },
      {
        "type": "h",
        "number": 2,
        "text": "What's going to be on the blog"
      },
      {
        "type": "p",
        "text": "Except for the 'tutorial' or 'experience-sharing' articles we will also write about what we think it's exciting in tech. Moreover, we'll be covering a few laid-back topics, such as what music we play when we launch a product or perhaps what games we've played recently."
      },
      {
        "type": "p",
        "text": "We hope you'll enjoy reading our thoughts and give us some feedback on the way."
      },
      {
        "type": "cover",
        "height": 520,
        "url": "posts/fadeit-blog-is-live/read.jpg"
      }
    ]
  }
]
