[
  {
    "id": "python3-flask-pil-in-memory-image",
    "title": "Serving generated images from memory",
    "intro": "Efficiently generating and serving images on-the-fly without the hassle of temporary files.",
    "cover": "cover_wide.jpg",
    "date": "2015-04-30T12:15:00.000Z",
    "author": {
      "name": "Sander Sink",
      "gplus": "https://plus.google.com/+sander_sink_ozooner?rel=author",
      "photo": "src/assets/img/team/fadeit_team_sander_sink.jpg",
      "job_title": "Software engineer"
    },
    "content": [
      {
        "type": "p",
        "text": "In this post, we are going to implement a simple image placeholder service like <a href=\"https://placehold.it/\" target=\"_blank\">placehold.it</a>. Use-cases for disposable images extend beyond placeholder services, commonly used to encode text into an image in order to protect websites from being scraped for valuable information.<br> A simple approach could be to generate an image, write it to disc and then serve the static file. One could improve the solution by using temporary files, however the process still remains inefficient. The solution, of course, is to use in-memory files to cut out the process of writing the file to the hard drive.<br/>We are using Pillow, a fork of Python's PIL (Python Imaging Library) that is actively maintained. While there is information out there on how to write an image into memory using StringIO module for Python2, using Python3 version io.StringIO results in an error:"
      },
      {
        "type": "code",
        "language": "python",
        "file": "error.txt"
      },
      {
        "type": "p",
        "text": "As hinted in the error message, the solution is to use io.BytesIO instead. See a minimal working sample below:"
      },
      {
        "type": "code",
        "language": "python",
        "file": "image.py.txt"
      },
      {
        "type": "p",
        "text": "Putting it all together, let's implement a simple Flask service that takes one parameter, extracts dimensions, generates an image and writes the passed parameter as a text on the image. Flask is amazing, allowing us to write fully functional web service in just 30 lines of code:"
      },
      {
        "type": "code",
        "language": "python",
        "file": "service.py.txt"
      },
      {
        "type": "p",
        "text": "To run this code, you may need to install few dependencies:"
      },
      {
        "type": "code",
        "language": "bash",
        "file": "libs.txt"
      },
      {
        "type": "img",
        "url": "posts/python3-flask-pil-in-memory-image/sample.png",
        "caption": "Generated image"
      }
    ]
  }
]
